austinawolf/NRF52_SDK_14.3/projects/ble_motion/ble_app_motion/main.c
		err_code = ble_motion_imu_send(&m_motion, motion_sample->gyro, motion_sample->accel);
		if ((err_code != NRF_SUCCESS) &&
			(err_code != NRF_ERROR_INVALID_STATE) &&
			(err_code != NRF_ERROR_RESOURCES) &&
			(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
		   )
		{
			APP_ERROR_HANDLER(err_code);
		}
	
	}
	
	if (motion_sample->data_flags & QUATERNION_DATA) {
		NRF_LOG_DEBUG("Quat: q0=%d, q0=%d, q0=%d, q0=%d,", motion_sample->quat[0], motion_sample->quat[1], motion_sample->quat[2], motion_sample->quat[3]);
		err_code = ble_motion_quaternion_send(&m_motion, motion_sample->quat);
		if ((err_code != NRF_SUCCESS) &&
			(err_code != NRF_ERROR_INVALID_STATE) &&
			(err_code != NRF_ERROR_RESOURCES) &&
			(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
		   )
		{
			APP_ERROR_HANDLER(err_code);
		}
		
	}


	

	
}
static void event(void * p_event_data, uint16_t event_size) {
	static unsigned long timestamp;
	nrf_get_ms(&timestamp);
	NRF_LOG_INFO("RADIO EVENT @ %ld ms", timestamp); //Toggle the status of the LED on each radio notification event   	
}

/**@brief Software interrupt 1 IRQ Handler, handles radio notification interrupts.
 */
void SWI1_IRQHandler(bool radio_evt)
{
    if (radio_evt)
    {
		app_sched_event_put(NULL, 0, event);
		app_sched_event_put(NULL, 0, motion_sample_scheduler_cb);
	}
}

/**@brief Function for initializing Radio Notification Software Interrupts.
 */
uint32_t radio_notification_init(uint32_t irq_priority, uint8_t notification_type, uint8_t notification_distance)
{
    uint32_t err_code;

    err_code = sd_nvic_ClearPendingIRQ(SWI1_IRQn);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    err_code = sd_nvic_SetPriority(SWI1_IRQn, irq_priority);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // Configure the event
    return sd_radio_notification_cfg_set(notification_type, notification_distance);
}

/**@brief Function for initializing Radio Notification Software Interrupts.
 */
static uint32_t enable_radio_notif(void)
{
    uint32_t err_code;

    err_code = sd_nvic_EnableIRQ(SWI1_IRQn);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    return err_code;
}

/**@brief Function for initializing Radio Notification Software Interrupts.
 */
static uint32_t disable_radio_notif(void)
{
    uint32_t err_code;

    err_code = sd_nvic_DisableIRQ(SWI1_IRQn);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    return err_code;
}


/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;
	uint32_t err_code = 0;
	
    // Initialize.
    log_init();
	
	//Schduler
	APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
	
	//system_init();
	twi_interface_init();
	
    // Initialize timer module.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

	//battery_level_timers_init();
	//buttons_leds_init(&erase_bonds);

	//ble init
    ble_stack_init();
    gap_params_init();
    gatt_init();
	
	#ifdef SAMPLE_ON_RADIO_NOTIF
	err_code = radio_notification_init(3, NRF_RADIO_NOTIFICATION_TYPE_INT_ON_INACTIVE, NRF_RADIO_NOTIFICATION_DISTANCE_NONE);
    APP_ERROR_CHECK(err_code);	
	#endif
	
    advertising_init();
    services_init();
    conn_params_init();
    peer_manager_init();
	
	MotionInit motion_init_s = {
		.sensor_config = DEFAULT_SENSOR_CONFIG,
		.event_cb = motion_sample_handler,
	};
	
	err_code = motion_init(&motion_init_s);	
	if (err_code) {
		NRF_LOG_ERROR("imu_init() %d", err_code);
	}
	nrf_pwr_mgmt_init();
	
    // Start execution.
    NRF_LOG_INFO("Orientation Sensor example started.");

    advertising_start(erase_bonds);

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
			app_sched_execute();
            power_manage();
        }
    }
}


